//////isi dari quran-data.js

var QuranData = {};

//------------------ Sura Data ---------------------

QuranData.Sura = [
	// [start, ayas, order, rukus, name, tname, ename, type]
	[],
	[0, 7, 5, 1, 'الفاتحة', "Al-Faatiha", 'The Opening', 'Meccan'],
    /// dan seterusnya 
];

//------------------ Juz Data ---------------------

QuranData.Juz = [
	// [sura, aya]
	[],	
	[1, 1], 	[2, 142], 	[2, 253], 	[3, 93], 	[4, 24],
	[4, 148], 	[5, 82], 	[6, 111], 	[7, 88], 	[8, 41],
	[9, 93], 	[11, 6], 	[12, 53], 	[15, 1], 	[17, 1],
	[18, 75], 	[21, 1], 	[23, 1], 	[25, 21], 	[27, 56],
	[29, 46], 	[33, 31], 	[36, 28], 	[39, 32], 	[41, 47],
	[46, 1], 	[51, 31], 	[58, 1], 	[67, 1], 	[78, 1],
	[115, 1] 
];

//------------------ Hizb Data ---------------------

QuranData.HizbQaurter = [
	// [sura, aya]
	[],	
	[1, 1], 	[2, 26], 	[2, 44], 	[2, 60],
	[2, 75], 	[2, 92], 	[2, 106], 	[2, 124],
	[2, 142], 	[2, 158], 	[2, 177], 	[2, 189],
	[2, 203], 	[2, 219], 	[2, 233], 	[2, 243],
    /// dan seterusnya
];

//------------------ Manzil Data ---------------------

QuranData.Manzil = [
	// [sura, aya]
	[],	
	[1, 1], 	[5, 1], 	[10, 1], 	[17, 1],
	[26, 1], 	[37, 1], 	[50, 1]
];

//------------------ Ruku Data ---------------------

QuranData.Ruku = [
	// [sura, aya]
	[],	
	[1, 1], 	[2, 1], 	[2, 8], 	[2, 21], 	[2, 30],
	[2, 40], 	[2, 47], 	[2, 60], 	[2, 62], 	[2, 72],
	[2, 83], 	[2, 87], 	[2, 97], 	[2, 104], 	[2, 113],
	[2, 122], 	[2, 130], 	[2, 142], 	[2, 148], 	[2, 153],
    /// dan seterusnya
];


//------------------ Page Data ---------------------

QuranData.Page = [
	// [sura, aya]
	[],	
	[1, 1], 	[2, 1], 	[2, 6], 	[2, 17], 	[2, 25],
	[2, 30], 	[2, 38], 	[2, 49], 	[2, 58], 	[2, 62],
	[2, 70], 	[2, 77], 	[2, 84], 	[2, 89], 	[2, 94],
	[2, 102], 	[2, 106], 	[2, 113], 	[2, 120], 	[2, 127],
    /// dan seterusnya

];

//------------------ Sajda Data ---------------------

QuranData.Sajda = [
	// [sura, aya, type]
	[],
	[7, 206, 'recommended'],
	[13, 15, 'recommended'],
	[16, 50, 'recommended'],
    /// dan seterusnya
];

///// isi dari quran.xml

<quran>
	<sura index="1" name="الفاتحة">
		<aya index="1" text="بِسمِ اللَّهِ الرَّحمـٰنِ الرَّحيمِ" />
		<aya index="2" text="الحَمدُ لِلَّهِ رَبِّ العالَمينَ" />
		<aya index="3" text="الرَّحمـٰنِ الرَّحيمِ" />
		<aya index="4" text="مالِكِ يَومِ الدّينِ" />
		<aya index="5" text="إِيّاكَ نَعبُدُ وَإِيّاكَ نَستَعينُ" />
		<aya index="6" text="اهدِنَا الصِّراطَ المُستَقيمَ" />
		<aya index="7" text="صِراطَ الَّذينَ أَنعَمتَ عَلَيهِم غَيرِ المَغضوبِ عَلَيهِم وَلَا الضّالّينَ" />
	</sura>
	<sura index="2" name="البقرة">
		<aya index="1" text="الم" bismillah="بِسمِ اللَّهِ الرَّحمـٰنِ الرَّحيمِ" />
		<aya index="2" text="ذٰلِكَ الكِتابُ لا رَيبَ ۛ فيهِ ۛ هُدًى لِلمُتَّقينَ" />
		<aya index="3" text="الَّذينَ يُؤمِنونَ بِالغَيبِ وَيُقيمونَ الصَّلاةَ وَمِمّا رَزَقناهُم يُنفِقونَ" />
		<aya index="4" text="وَالَّذينَ يُؤمِنونَ بِما أُنزِلَ إِلَيكَ وَما أُنزِلَ مِن قَبلِكَ وَبِالآخِرَةِ هُم يوقِنونَ" />
		<aya index="5" text="أُولـٰئِكَ عَلىٰ هُدًى مِن رَبِّهِم ۖ وَأُولـٰئِكَ هُمُ المُفلِحونَ" />
		<aya index="6" text="إِنَّ الَّذينَ كَفَروا سَواءٌ عَلَيهِم أَأَنذَرتَهُم أَم لَم تُنذِرهُم لا يُؤمِنونَ" />
        /// dan seterusnya

    </sura>

    <sura index="3" name="آل عمران">
		<aya index="1" text="الم" bismillah="بِسمِ اللَّهِ الرَّحمـٰنِ الرَّحيمِ" />
		<aya index="2" text="اللَّهُ لا إِلـٰهَ إِلّا هُوَ الحَيُّ القَيّومُ" />
		<aya index="3" text="نَزَّلَ عَلَيكَ الكِتابَ بِالحَقِّ مُصَدِّقًا لِما بَينَ يَدَيهِ وَأَنزَلَ التَّوراةَ وَالإِنجيلَ" />
		<aya index="4" text="مِن قَبلُ هُدًى لِلنّاسِ وَأَنزَلَ الفُرقانَ ۗ إِنَّ الَّذينَ كَفَروا بِآياتِ اللَّهِ لَهُم عَذابٌ شَديدٌ ۗ وَاللَّهُ عَزيزٌ ذُو انتِقامٍ" />
		<aya index="5" text="إِنَّ اللَّهَ لا يَخفىٰ عَلَيهِ شَيءٌ فِي الأَرضِ وَلا فِي السَّماءِ" />
        /// dan seterusnya

    </sura>

    /// dan seterusnya
    
</quran>

